nTl = {
    "1": "א",
    "2": "ב",
    "3": "ג",
    "4": "ד",
    "5": "ה",
    "6": "ו",
    "7": "ז",
    "8": "ח",
    "9": "ט",
    "10": "י",
    "11": "כ",
    "12": "ל",
    "13": "מ",
    "14": "נ",
    "15": "ס",
    "16": "ע",
    "17": "פ",
    "18": "צ",
    "19": "ק",
    "20": "ר",
    "21": "ש",
    "22": "ת"
}

lTn = {
    "א": "1",
    "ב": "2",
    "ג": "3",
    "ד": "4",
    "ה": "5",
    "ו": "6",
    "ז": "7",
    "ח": "8",
    "ט": "9",
    "י": "10",
    "כ": "11",
    "ל": "12",
    "מ": "13",
    "נ": "14",
    "ס": "15",
    "ע": "16",
    "פ": "17",
    "צ": "18",
    "ק": "19",
    "ר": "20",
    "ש": "21",
    "ת": "22"
}

text = input()
c = int(input())
tm1 = []
for i in text:
    if i in lTn:
        tm1.append(str((int(lTn[i])% 22) + 1))
        lTn[i] = str((int(lTn[i]) % 22) + 1)
    else:
        tm1.append(i)
       
tm2 = [nTl[i] if i in nTl else i for i in tm1]
tms = tm2[c:] + tm2[:c]
print("".join(tms))
